#### 📖 Terraform Plan ('src/core/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.terraform_weu will be created
  + resource "azurerm_resource_group" "terraform_weu" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "terraform-state-rg"
      + tags     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
    }

  # module.storage_accounts_itn.azurerm_storage_account.terraform will be created
  + resource "azurerm_storage_account" "terraform" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopitntfst001"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "terraform-state-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)
    }

  # module.storage_accounts_itn.module.iam_adgroup_admins.module.storage_account.azurerm_role_assignment.blob["iopitntfst001|*|owner"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/terraform-state-rg/providers/Microsoft.Storage/storageAccounts/iopitntfst001"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts_itn.module.iam_adgroup_auth_admins.module.storage_account.azurerm_role_assignment.blob["iopitntfst001|*|writer"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "912c0ba1-90b5-47eb-83f7-bf1e1294cd5c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/terraform-state-rg/providers/Microsoft.Storage/storageAccounts/iopitntfst001"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts_itn.module.iam_adgroup_bonus_admins.module.storage_account.azurerm_role_assignment.blob["iopitntfst001|*|writer"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "831e5214-2f68-4a13-b25f-7bec962c7e1b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/terraform-state-rg/providers/Microsoft.Storage/storageAccounts/iopitntfst001"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts_itn.module.iam_adgroup_com_admins.module.storage_account.azurerm_role_assignment.blob["iopitntfst001|*|writer"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/terraform-state-rg/providers/Microsoft.Storage/storageAccounts/iopitntfst001"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts_itn.module.iam_adgroup_svc_admins.module.storage_account.azurerm_role_assignment.blob["iopitntfst001|*|writer"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "100cb2bb-92d5-40ad-bfa9-1d3c676f13e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/terraform-state-rg/providers/Microsoft.Storage/storageAccounts/iopitntfst001"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts_itn.module.iam_adgroup_wallet_admins.module.storage_account.azurerm_role_assignment.blob["iopitntfst001|*|writer"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/terraform-state-rg/providers/Microsoft.Storage/storageAccounts/iopitntfst001"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on ../_modules/vpn/main.tf line 22, in module "vpn":
  22:       aad_audience          = data.azuread_application.vpn_app.application_id

The attribute "application_id" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.azdoa_weu.module.azdoa_snet.azurerm_subnet.this,
  on .terraform/modules/azdoa_weu.azdoa_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 11 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
